/* No comment provided by engineer. */
"AboutStation" = "Music	One אודות";

/* No comment provided by engineer. */
"Application" = "תוכנה";

/* No comment provided by engineer. */
"Cleanup" = "ניקיון";

/* No comment provided by engineer. */
"Favorites" = "מועדפים";

/* No comment provided by engineer. */
"More" = "עוד";

/* No comment provided by engineer. */
"Song Refresh" = "רענון שירים";

/* No comment provided by engineer. */
"Streaming Options" = "Streaming Options";

/* No comment provided by engineer. */
"Version" = "גרסה";

/* No comment provided by engineer. */
"About Us" = "אודותינו";

/* No comment provided by engineer. */
"Contact Developer" = "Contact Developer";

/* No comment provided by engineer. */
"Contact Us" = "Contact Us";

/* No comment provided by engineer. */
"Entities" = "Entities";

/* No comment provided by engineer. */
"CachedSongs" = "שירים בזכרון";

/* No comment provided by engineer. */
"Missed" = "Missed";

/* No comment provided by engineer. */
"NowPlaying" = "מנגן עכשיו";

/* No comment provided by engineer. */
"KBS" = "k";

/* No comment provided by engineer. */
"IsTopRated" = "כרגע ב-20 המובילים";

/* No comment provided by engineer. */
"RateIt" = "דרגו";

"Settings" = "הגדרות";

/* Streaming Options */
"WIFI Quality" = "איכות מצוינת (3G/WIFI)";
"WIFI bps" = "128k mp3 — 56.25 Mb/שעה";
"EDGE Quality" = "איכות טובה (EDGE)";
"EDGE bps" = "48k aac+ — 18 Mb/שעה";
